---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Next
source: html/6441aee0-7463-057a-4442-8291b63c75ce.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Next Method

Moves this iterator to the next step of network iteration.

## Syntax (C#)
```csharp
public void Next()
```